# 1) Для виконання цього завдання обов'язково використовуйте механізм функцій
# вищого порядку (higher order functions).
# Створіть функцію, що відображає лінію (горизонтальну або вертикальну)
# з використанням символу, зазначеного користувачем. Користувач визначає
# символ і яку лінію відображати.
# Сигнатура функції:
# def show_line(symbol, function_to_call)
#
# symbol — символ для відображення.
# function_to_call — функція для відтворення лінії (вертикальна лінія або
# горизонтальна лінія, на один тип лінії — одна функція).

def horizontal_line(symbol):
    print(symbol * 10)

def vertical_line(symbol):
    for i in range(10):
        print(symbol)

def show_line(symbol, function_to_call):
    function_to_call(symbol)

symbol = input("Введіть символ: ")
line = input("1 - горизонтальна, 2 - вертикальна: ")

if line == "1":
    show_line(symbol, horizontal_line)
elif line == "2":
    show_line(symbol, vertical_line)
else:
    print("Невірний вибір")

# 2) Напишіть декоратор measure_time, який вимірює час виконання функції та виводить його на екран.
# Декоратор потрібно застосувати до функції calculate_sum(), яка обчислює суму всіх чисел від 1 до n.
# Вимоги до виконання
# Створіть декоратор measure_time, який приймає функцію як аргумент.
# Усередині декоратора створіть вкладену функцію, яка:
# фіксує час перед виконанням основної функції;
# викликає основну функцію та зберігає її результат;
# фіксує час після виконання основної функції;
# виводить час виконання у секундах;
# повертає результат основної функції.
#
# Використайте модуль time для вимірювання часу.
# Застосуйте декоратор до функції calculate_sum(n).
# Викличте функцію з аргументом 1_000_000 та виведіть отриману суму.
#
# Приклад очікуваного результату
# text
# Час виконання функції: 0.052 секунди
# Сума чисел: 500000500000

import time

def measure_time(func):
    def wrapper(n):
        start = time.time()
        result = func(n)
        end = time.time()

        print("Час виконання функції:", round(end - start, 3), "секунди")
        return result

    return wrapper


@measure_time
def calculate_sum(n):
    return sum(range(1, n + 1))


result = calculate_sum(1_000_000)
print(f"Сума чисел: {result}")